{
  "minisymposium_title": "Infectious Disease in Space and Time: Advances in Mathematical Biology, Physiology, Public Health, and Spatial Analysis of Social Systems",
  "talks": [
    {
      "title": "Analyzing Zoonotic Spillover Risk Under Extreme Weather Events Using a Deterministic and Stochastic Lotka-Volterra Modeling Approach",
      "speakers": [
        {
          "name": "Barsha Saha",
          "affiliation": "University of Missouri-Kansas City"
        }
      ],
      "abstract": "Extreme weather events —both acute and chronic—are reshaping ecological systems by altering wildlife abundance, dispersal, and infection prevalence, thereby heightening zoonotic spillover risk. We develop a zoonotic spillover framework that couples wildlife community dynamics with human exposure under weather disturbance. Wildlife populations are modeled by a stochastic competitive Lotka–Volterra system with diffusion–advection terms, where Brownian noise represents chronic fluctuations and Lévy jumps capture acute shocks. These dynamics determine both direct exposure from infected wildlife and indirect exposure through free-living pathogens shed into the environment which is considered as proportion of infected wildlife. Using a dose–response formulation, we quantify zoonotic spillover probability as a function of species densities, movement, and environmental pathogen loads. Analytical results establish conditions for persistence and extinction of wildlife reservoirs, while simulations reveal how intensified stochastic forcing drives shifts in community structure, pathogen load, and human exposure risk. By linking species dynamics to spillover pathways, this framework advances our understanding of how climate-driven extreme events amplify the likelihood of zoonotic emergence.",
      "_match": "title"
    },
    {
      "title": "Approximate Solutions for HIV Infection Dynamics via Legendre Collocation",
      "speakers": [
        {
          "name": "Beyza Cetin",
          "affiliation": "Missouri University Science and Technology"
        }
      ],
      "abstract": "We propose a Legendre polynomial collocation framework for simulating an HIV infection model that tracks uninfected CD4$^+$ T cells, productively infected cells, and free virions. The scheme computes a polynomial approximation of the solution via Legendre collocation and reconstructs the state variables by integrating this approximation consistent with the prescribed initial data. To provide a fair evaluation, we adopt benchmark parameter sets from the literature  and compare against the Laplace--Adomian decomposition method, the variational iteration method, the modified VIM , and a classical Runge--Kutta solver. Even at modest polynomial degrees (e.g., \\(N=8\\)), Legendre collocation yields consistently smaller residuals of the governing equations for \\(T\\), \\(I\\), and \\(V\\), and produces trajectories that closely track reference solutions. Accuracy is comparable to or better than competing approaches. These findings support Legendre collocation as a reliable, easy-to-implement alternative for precise simulation and benchmarking of nonlinear ODE systems in virus dynamics.",
      "_match": "title"
    },
    {
      "title": "Bayesian Inference of MRSA Transmission in Drug-Using and Non–Drug-Using Patient Populations",
      "speakers": [
        {
          "name": "Kiel Corkran",
          "affiliation": "University of Missouri-Kansas City"
        }
      ],
      "abstract": "Methicillin-resistant Staphylococcus aureus (MRSA) remains a critical public health challenge, particularly in safety-net hospitals (SAHs) that serve high-risk, underserved populations. Drug use is a known risk factor for healthcare-associated MRSA (HA-MRSA) due to repeated hospital exposures, skin barrier disruptions, and comorbidities. This study investigates MRSA transmission dynamics among drug-using patients in an urban, multi-center SAH over a five-year period (2019–2023), using Bayesian parameter estimation techniques. We performed a retrospective cohort analysis using 187,040 electronic health records, stratifying patients into drug-using and non–drug-using groups based on clinical documentation. A compartmental infectious disease model was developed to simulate transmission processes within the hospital. Key parameters—transmission, isolation, and discharge rates were estimated using the Delayed Rejection Adaptive Metropolis (DRAM) Markov Chain Monte Carlo algorithm, yielding full posterior distributions and credible intervals. Results indicate that drug-using patients experienced consistently higher MRSA transmission rates than their non–drug-using counterparts, with rates reaching 0.60/month (0.020/day) in some inpatient units. Although transmission declined during the peak of the COVID-19 pandemic (2021), a sharp resurgence was observed by 2023, including new outbreaks in units previously unaffected by MRSA. These trends suggest both structural vulnerabilities and the need for targeted infection control measures in this population. Our findings highlight the utility of Bayesian compartmental models in assessing pathogen dynamics within heterogeneous hospital populations. Sustained surveillance, stratified interventions, and improved care coordination for drug-using patients are essential to reduce HA-MRSA incidence in safety-net settings.",
      "_match": "title"
    },
    {
      "title": "Leveraging mobility data to understand COVID-19 Deaths in United States",
      "speakers": [
        {
          "name": "Folashade B. Agusto",
          "affiliation": "University of Kansas"
        }
      ],
      "abstract": "In the United States, COVID-19 has resulted in 103,436,829 confirmed cases and 1,225,706 confirmed deaths. The pandemic stands as the deadliest disaster in U.S. history and was the nation’s third-leading cause of death in 2020, following heart disease and cancer. In this study, we examine the geographical patterns of COVID-19 deaths at the county level across the country by utilizing five newly defined spatial weights, developed using mobility data from Google and Facebook. Google. These spatial weights are based on the correlation of mobility data between two spatial units and a threshold distance decay between them. We analyze the spatial distribution of COVID-19 deaths using datasets from County Health Rankings and Roadmaps, as well as the Centers for Disease Control and Prevention, focusing on the COVID-19 era spanning 2020, 2021, and 2022. By incorporating spatial covariate information into the new spatial weight definitions, these methods more accurately represent the relationships between spatial units and enhance the performance of spatial analysis techniques. Three of the methods effectively captured nearly all high-incident counties and accurately identified hot and cold spot clusters over the years. In contrast, the other two methods failed to identify many counties with high cases, classifying them as insignificant.",
      "_match": "title"
    },
    {
      "title": "Spatio-temporal Analysis of Domestic Violence in Puerto Rico",
      "speakers": [
        {
          "name": "Phylis Njeri Muniu",
          "affiliation": "University of Kansas"
        }
      ],
      "abstract": "Domestic violence is a growing public health concern in Puerto Rico, with reported cases rising sharply in recent years. This study examined the spatiotemporal relationships between domestic violence and socioeconomic factors from 2020 to 2022 using Geographically and Temporally Weighted Regression (GTWR). The analysis reveals significant regional variations in predictors such as education, marital status, and income stress. The results highlight the importance of accounting for spatial and temporal heterogeneity to inform targeted prevention and intervention strategies, ultimately guiding more effective allocation of public health resources.",
      "_match": "title"
    },
    {
      "title": "Complex Structure in the Endemic Equilibrium Set of an  SIS Epidemic Patch Model with the Mass-Action Infection Mechanism",
      "speakers": [
        {
          "name": "Rachidi B. Salako",
          "affiliation": "University of Nevada Las Vegas"
        }
      ],
      "abstract": "We investigate the structure of the endemic equilibrium (EE) set in a multi-patch SIS epidemic model with mass-action transmission. For the corresponding single-patch model, the basic reproduction number $\\mathcal{R}_0$ completely determines the disease dynamics: a unique stable EE exists if and only if $\\mathcal{R}_0 > 1$. In contrast, the multi-patch setting exhibits far more complex behavior. First, we show that as the dispersal rate of susceptible individuals $d_S$ varies, the EE set consists of a finite union of disjoint curves. Under mild conditions, when $\\mathcal{R}_0 < 1$, the closure of each curve forms a loop in the $d_S \\times \\|{I}\\|_1$-plane, where $\\|{I}\\|_1$ denotes the total infected population at equilibrium. When $\\mathcal{R}_0 > 1$, the EE set contains two distinct types of curves: bounded and unbounded. Moreover, the structure of the EE set as $d_S \\to 0$ provides explicit spatial patterns of the EEs, offering insights into how restricting susceptible movement influences disease dynamics. Second, using $\\mathcal{R}_0$ as the bifurcation parameter, we establish that the EE set forms a simple unbounded curve in the $\\mathcal{R}_0 \\times \\|{I}\\|_1$-plane, which may exhibit an S-shape and undergo either a backward or forward transcritical bifurcation at $\\mathcal{R}_0 = 1$. These results refine and extend previous findings by revealing novel and intricate structures within the EE set. They underscore the interplay between population movement, total population size, and spatial heterogeneity, providing new insights into the long-term dynamics of infectious diseases. This is a joint work with Kingsley Ukandu.",
      "_match": "title"
    },
    {
      "title": "Delayed human behavioral adaptation from information lag shapes epidemic wave dynamics",
      "speakers": [
        {
          "name": "MD Shahriar Mahmud",
          "affiliation": "Iowa State University"
        }
      ],
      "abstract": "The recurrence of epidemic waves has been a hallmark of infectious disease outbreaks. Repeated surges in infections pose significant challenges to public health systems, yet the mechanisms that drive these waves remain insufficiently understood. Most prior models attribute epidemic waves to exogenous factors, such as transmission seasonality, viral mutations, or implementation of public health interventions. We show that epidemic waves can emerge autonomously from the feedback loop between infection dynamics and human behavior. Our results are based on a behavioral framework in which individuals continuously adjust their level of risk mitigation subject to their perceived risk of infection, which depends on information availability and disease severity. We show that delayed behavioral responses alone can lead to the emergence of multiple epidemic waves. The magnitude and frequency of these waves depend on the interplay between behavioral factors (delay, severity, and sensitivity of responses) and disease factors (transmission and recovery rates). Notably, if the response is either too prompt or excessively delayed, multiple waves cannot emerge. Our results further align with previous observations that adaptive human behavior can produce non-monotonic final epidemic sizes, shaped by the trade-offs between various biological and behavioral factors--namely, risk sensitivity, response stringency, and disease generation time. Interestingly, we found that the minimal final epidemic size occurs on regimes that exhibit a few damped oscillations. Altogether, our results emphasize the importance of integrating social and operational factors into infectious disease models, in order to capture the joint evolution of adaptive behavioral responses and epidemic dynamics.",
      "_match": "title"
    },
    {
      "title": "Higher Codimension Bogdanov-Takens Bifurcation in Predator-Prey Systems with Additional Food Supplementation and Predator Competition",
      "speakers": [
        {
          "name": "Kanishka Goyal",
          "affiliation": "Iowa State University"
        }
      ],
      "abstract": "The theory of \"additional food\" suggests that a predator's ability to control pest populations can be enhanced by providing supplementary food sources. We analyze a predator–prey system incorporating additional food supplementation and intraspecific predator competition, focusing on its bifurcation structure. In this model, we identify parameter regimes in which the interior equilibrium undergoes a higher-codimension Bogdanov–Takens (BT) bifurcation. Analytical conditions for the critical parameters are derived, and the equilibrium is shown to correspond to a cusp singularity of codimension two. Our results provide deeper insight into how additional food supplementation and predator competition jointly shape complex population dynamics, with implications for sustainable pest management.",
      "_match": "title"
    },
    {
      "title": "An eco-epidemiological model with prey taxis and \"slow\" diffusion",
      "speakers": [
        {
          "name": "Rana Parshad",
          "affiliation": "Iowa State University"
        }
      ],
      "abstract": "In this work we investigate the effects of prey-taxis on the existence of global-in-time solutions and dynamics in an eco-epidemiological model, under the influence of slow dispersal characterized by the p-Laplacian operator, and enhanced mortality of the infected prey, subject to specific assumptions on the taxis sensitivity functions. We prove the global existence of classical solutions when the infected prey disperses via classical laplacian operators and exhibits standard mortality. Under the assumption that the infected prey disperses \"slowly\" and exhibits enhanced mortality, we prove the global existence of weak solutions. We discuss applications to biological control of pests, under the prevalence of disease in the pest population.",
      "_match": "title"
    },
    {
      "title": "Dual Control of Lyme Disease and Emerald Ash Borer Under Climatic Forcing: A Hybrid ODE–PDE Model with Lévy Noise",
      "speakers": [
        {
          "name": "Majid Bani-Yaghoub",
          "affiliation": "University of Missouri-Kansas City"
        }
      ],
      "abstract": "The ongoing rise in Lyme disease incidence across the Upper Midwest coincides with ecological disruptions such as emerald ash borer (EAB) invasion and ash tree mortality, which in turn affect host-vector dynamics within forest ecosystems. In this study, we develop a hybrid ODE–PDE model with Lévy noise to capture the endemic spatiotemporal dynamics of Lyme disease transmission in Minnesota, incorporating periodic extreme cold events (polar vortexes) and forest management interventions. We develop a dual control strategy which can be deployed immediately following cold-induced population dips. It can be shown that the system can transition from an endemic to a reduced-endemic or near-elimination state. The results have been numerically validated. Our findings highlight the importance of synchronizing ecological interventions with climatic windows to enhance effectiveness, reduce long-term intervention costs, and achieve both public health and conservation objectives.",
      "_match": "title"
    }
  ]
}